Revit 2027 API
View.CanViewBeDuplicated Method
 Identifies if this view can be duplicated.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanViewBeDuplicated(
	ViewDuplicateOption duplicateOption
)
Public Function CanViewBeDuplicated (
	duplicateOption As ViewDuplicateOption
) As Boolean
public:
bool CanViewBeDuplicated(
	ViewDuplicateOption duplicateOption
)
member CanViewBeDuplicated :
        duplicateOption : ViewDuplicateOption -> bool
Parameters
duplicateOption ViewDuplicateOption
 The option to use when duplicating the view.
Return Value
Boolean
 True if the view can be duplicated, false otherwise.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
View Class
Autodesk.Revit.DB Namespace